{"website":"blog.eddiefed.com","author":"Eddie Federmeyer","articles":[{"title":"First Blog Post!","body":"<p>\n\n<h4>** Note: This will be a super long post</h4>\n\n<b>So..</b> I finally decided to get this blog up and running!<br>\nI'll mostly be using this as a sort <i>diary/blog/devlog</i>.<br>\nMostly all three and more at once to be honest...\n<br><br>\n\nA couple things for future me first though:\n<ul>\n<li>If you ever dare put any excessive CSS on this page I'll kill future me...</li>\n<li>Anime is good, don't become like Tommy.</li>\n<li>You better finish DoodleDoodleDrawDraw...</li>\n<li>And also the free-games-alert project.</li>\n</ul>\n\nI thought I'd also include a list of crap happening in the world right now so I can look back\n<ul>\n<li>George Floyd protests are happening everywhere. The world is just crazy right now.</li>\n<li>The US is a madhouse, honestly, the political divide here is ridiculous. Honestly it's just saddening.</li>\n<li>COVID-19 is still everywhere in the country.</li>\n</ul>\n\nI think I'm gonna start posting <i>movie/tv/anime</i> reviews for the shows I watch.<br>\nRecently I finished <i>Fruits Basket</i> and I started recently <i>Oreimo</i> I'll write about those soon!\n\n<br>\n<br>\n\nMan this is such a random post. I'm just glad I got this blog thingy working!!\n\n<br>\nOkay BYE!!!\n\n<br>\n<br>\n<img src=\"https://www.eddiefed.com/megumin/1.gif\" width=\"50\">\n<tt>- Eddie</tt> \n\n\n\n\n</p>","topic":"random","date":"Thu Jun 04 2020 22:21:38 GMT-0500 (Central Daylight Time)"},{"title":"My Bucket List and some life reflections","body":"Currently as I'm writing this it's <b>5:18am</b> but I feel like i need to write something. <br>Even though this blog will likely never be read by anyone, which is fine, it's nice to write thoughts somewhere...\n\n<br><br>\n\nAnyways, I've been doing a lot of reflections the past couple days since I tend to be staying up super late (like right now, 5am...). <br>So I thought it would be a cool idea to start making a list of things I'd like to do in the future. <br>\nAnd the list I'll have here is going to be a live list on Github (yeah I know, kinda funny huh) <s>because that way I can embed it</s> Actually never mind, I cant...<br><br>\nIt's going to be dreams I have, dreams I might never get to live or achieve, but still, I'd love to at least try, that way I can experience life to the fullest.\n\n<br>\n&ensp;&ensp;<a href=\"https://gist.github.com/EddieFed/da1ebc2b64c363e2e73f8b692d8abca6#file-bucketlist\">Heres the list! --- \n https://gist.github.com/EddieFed/da1ebc2b64c363e2e73f8b692d8abca6#file-bucketlist</a>\n\n<br><br>\n\nAnyways...<br> I want my next post to be a reflection on my trip to Europe last year before school.<br> I had meant to write about it a long time ago but I keep putting it off for some reason.<br> I miss the experience and making this bucket list and thinking of traveling really brings back those memories...<br> Hopefully I'll write the post tomorrow (today tomorrow, same thing I guess it's <b>6:25am</b>). <br><br>\n\nSo yeah, I want to write about my trip, but I got a couple other ideas to write about. Here's a list of ideas I have to write about\n\n<ul>\n<li>The trip to Europe (Like I said above)</li>\n<li>My experience with covid-19 so far</li>\n<li>My opinions on the world's political polarization</li>\n<li>My future, college, career, etc...</li>\n<li>Anime reviews like I said last post</li>\n\n</ul>\n\n<br><br>\n\nHopefully I can get into a habit of posting daily so it becomes a routine!\n(Wow I got so distracted trying to get the Github embed to work it took an hour to write this post ;-;)\n\n<br><br>\n- Eddie","topic":"reflection","date":"Mon Jun 08 2020 06:36:41 GMT-0500 (Central Daylight Time)"},{"title":"Crazy Anime today","body":"I almost forgot to post today! Already can't even go two days straight wow...\n\n<br><br>\n\nAnyway. I did watch a couple anime movies today; I watched \"Redline\" and \"Perfect Blue\".<br>\nBoth of them were pretty amazing in their own ways. \n\n<br><br>\n\n<a href=\"https://en.wikipedia.org/wiki/Redline_(2009_film)\">Redline</a> was a futuristic kind of punk anime about racing, very much like speed racer but in space. It had an awesome style and very well written with pretty great music.\n\n<br><br>\n\n<a href=\"https://en.wikipedia.org/wiki/Perfect_Blue\">Perfect Blue</a> was basically the exact opposite side of the genre spectrum. <br>\nIt was a thriller, psychological horror movie, about a girl who loses touch between her own personality and the personality that people expect from her; all while being stalked and targeted throughout the movie.<br>\nIt was honestly a really jarring film to watch. It's scary in the sense of how heavily people invest their lives into creating an online persona of themselves...<br>\nHere's a video I found that talked more in depth about it and made me realize what that really means nowadays versus when the movie was made.<br>\n<a href=\"https://www.youtube.com/watch?v=MJmK5SOeQBc\">Why Perfect Blue is Terrifying - Super Eyepatch Wolf</a>\n\n<br><br>\n\nAlso today I spent a lot of time on Minecraft with my friends, I'm in the middle of building a massive tree house since supposedly in the \"master builder\"<br>\nI'm not sure about that statement, but I'll take it.<br>\nWe also watched that movie Redline together over a PS4 party chat and all watching it on our own phones at the same time so we can talk together, I really hope we do that again.<br>\nBeing stuck in quarantine from covid-19, that kind of think is really therapeutic...\n\n<br><br>\n\nAnyway, bye bye! <br>\n- Eddie <3","topic":"random","date":"Tue Jun 09 2020 04:59:03 GMT-0500 (Central Daylight Time)"},{"title":"Destiny 2 & Europe post update!","body":"So I started writing my post about my trip from Europe in 2019.<br>\nI'm doing it over the course of a couple days and writing it the style of a journal.<br>\nIt's actually really soothing to look over pictures and reflect on them.<br>\nHopefully I'll have it done soon!\n<br><br>\nIn other news, I bought my friends Anthony and myself the season pass for Destiny 2 (Season of the Arrivals).<br>\nHopefully it's fun. So far we completed the base quest and played a bit just for fun today.<br>\nI'm really thankful I got my friends to play games with in Quarantine, seriously, I'd be losing my mind if I didn't<br>\n<br><br>\nAnyways, Here's a fun song!\n<br>\n<iframe width=\"400\" height=\"230\" src=\"https://www.youtube-nocookie.com/embed/sLp8LDylshU\" frameborder=\"0\" allow=\"accelerometer; autoplay; encrypted-media; gyroscope; picture-in-picture\" allowfullscreen></iframe>\n","topic":"random","date":"Thu Jun 11 2020 01:21:25 GMT-0500 (Central Daylight Time)"},{"title":"Diary of a Boy in Quarantine","body":"So I actually writer this yesterday night at 5am, I forgot to post it and I had it saved so cool.<br>\nBegin random boring rant from an unintelligent teenager:<br><br>\n\nHi this is a rant post just fyi :/<br><br><br>\n\nSo the past couple days I've realized I'm pretty horrible at being consistent with anything.<br> \nI've been sleeping at 5-7am and waking up at 2-4pm or not even sleeping at all for a day.<br><br>\n\nThat got me thinking. It's been exactly 100 days since I've been home in quarantine for COVID-19.<br>\nWhich is both kind of crazy since my family's quarantine means literally we haven't gone out anywhere unless it's an essential.<br>\nAt the same time, I've been hearing about friends out having a going away party for a friend leaving for the Navy.<br>\nFor the first 2 months I gotta say, quarantine was wonderful, seriously, I felt so free.<br><br>\n\nHaving had gotten out of a decently long relationship a couple months prior that really hit me hard.<br>\nI felt like I was free from the social pressures of school. After online classes and AP tests ended, I basically dedicated a good amount of time to playing video games.<br>\nMostly Destiny 1 and 2. Which I mean they're super fun, but recently I noticed within myself I've been pushing a lot of other things aside for playing games.<br><br>\n\nAt the same time as all that I have college coming up.<br>\nWith COVID-19 college is gonna be so weird. I barely have any idea about how housings gonna work, let alone classes.<br><br>\n\nAlong with college creeping up, a decent loss of motivation which is leading me to video games, a lot of my old friends seem to have left me in various ways<br>\nAt least it feels like it. Throughout quarantine a couple people have asked me early on when things started opening to hang out.After saying no to them, it seems nobody wants to talk to me.<br>\nIt's kinda hard considering I liked to talk to everyone. There's few people I enjoy playing games with, and I'm lucky to have them, but most people I only like talking in person.<br>\n(In general I'm not a gamer, so that's why there's only a couple people I like gaming with, that probably came off as pretty pretentious though).<br><br>\n\nI really don't know what to do, every night.<br>\nI stay up until 6am thinking about how I feel lonely, I wake up at 2pm to play games for a couple hours, eat dinner, help my family with sorting stuff in the house for donating<br>\n(quarantine got us to start some spring cleaning and it's been going on forever), and sleep. It's an endless cycle that isn't gonna end any time soon.<br><br>\n\nI've been trying to brainstorm things to get me into a good routine. A couple of my ideas are:\n<ul>\n<li>Sleeping schedule midnight -7:30am.</li>\n<li>Start limiting video games to 7:30am-noon. Occasionally other times but mostly around that time. I would like to work on projects and help\naround the house without being distracted by games.</li>\n<li>Start a regular work out routine where I run right when I wake up, then work out and shower after. Setting up my day good.</li>\n</ul>\nThey're weird goals, but I need some consistency in my life now.<br>\nAt first inconsistently feels truly liberating until it becomes uncontrollable.<br>\nThen it becomes destructive, and that's where I'm at right now.<br>\nSo in order to combat the growing depressiveness in my mood and everyday life I think I'll start doing that.<br><br>\n\nIf you read this, you're super weird, just sayin'. But thanks for reading if you did <3<br><br>\n\nOh yeah... I used to have Spotify Premium since I worked at Starbucks, now that I don't, it sucks. Just sayin'.","topic":"random","date":"Thu Jun 25 2020 04:24:04 GMT-0500 (Central Daylight Time)"}]}