{"website":"blog.eddiefed.com","author":"Eddie Federmeyer","articles":[{"title":"First Blog Post!","body":"<p>\n\n<h4>** Note: This will be a super long post</h4>\n\n<b>So..</b> I finally decided to get this blog up and running!<br>\nI'll mostly be using this as a sort <i>diary/blog/devlog</i>.<br>\nMostly all three and more at once to be honest...\n<br><br>\n\nA couple things for future me first though:\n<ul>\n<li>If you ever dare put any excessive CSS on this page I'll kill future me...</li>\n<li>Anime is good, don't become like Tommy.</li>\n<li>You better finish DoodleDoodleDrawDraw...</li>\n<li>And also the free-games-alert project.</li>\n</ul>\n\nI thought I'd also include a list of crap happening in the world right now so I can look back\n<ul>\n<li>George Floyd protests are happening everywhere. The world is just crazy right now.</li>\n<li>The US is a madhouse, honestly, the political divide here is ridiculous. Honestly it's just saddening.</li>\n<li>COVID-19 is still everywhere in the country.</li>\n</ul>\n\nI think I'm gonna start posting <i>movie/tv/anime</i> reviews for the shows I watch.<br>\nRecently I finished <i>Fruits Basket</i> and I started recently <i>Oreimo</i> I'll write about those soon!\n\n<br>\n<br>\n\nMan this is such a random post. I'm just glad I got this blog thingy working!!\n\n<br>\nOkay BYE!!!\n\n<br>\n<br>\n<img src=\"https://www.eddiefed.com/megumin/1.gif\" width=\"50\">\n<tt>- Eddie</tt> \n\n\n\n\n</p>","topic":"random","date":"Thu Jun 04 2020 22:21:38 GMT-0500 (Central Daylight Time)"},{"title":"My Bucket List and some life reflections","body":"Currently as I'm writing this it's <b>5:18am</b> but I feel like i need to write something. <br>Even though this blog will likely never be read by anyone, which is fine, it's nice to write thoughts somewhere...\n\n<br><br>\n\nAnyways, I've been doing a lot of reflections the past couple days since I tend to be staying up super late (like right now, 5am...). <br>So I thought it would be a cool idea to start making a list of things I'd like to do in the future. <br>\nAnd the list I'll have here is going to be a live list on Github (yeah I know, kinda funny huh) <s>because that way I can embed it</s> Actually never mind, I cant...<br><br>\nIt's going to be dreams I have, dreams I might never get to live or achieve, but still, I'd love to at least try, that way I can experience life to the fullest.\n\n<br>\n&ensp;&ensp;<a href=\"https://gist.github.com/EddieFed/da1ebc2b64c363e2e73f8b692d8abca6#file-bucketlist\">Heres the list! --- \n https://gist.github.com/EddieFed/da1ebc2b64c363e2e73f8b692d8abca6#file-bucketlist</a>\n\n<br><br>\n\nAnyways...<br> I want my next post to be a reflection on my trip to Europe last year before school.<br> I had meant to write about it a long time ago but I keep putting it off for some reason.<br> I miss the experience and making this bucket list and thinking of traveling really brings back those memories...<br> Hopefully I'll write the post tomorrow (today tomorrow, same thing I guess it's <b>6:25am</b>). <br><br>\n\nSo yeah, I want to write about my trip, but I got a couple other ideas to write about. Here's a list of ideas I have to write about\n\n<ul>\n<li>The trip to Europe (Like I said above)</li>\n<li>My experience with covid-19 so far</li>\n<li>My opinions on the world's political polarization</li>\n<li>My future, college, career, etc...</li>\n<li>Anime reviews like I said last post</li>\n\n</ul>\n\n<br><br>\n\nHopefully I can get into a habit of posting daily so it becomes a routine!\n(Wow I got so distracted trying to get the Github embed to work it took an hour to write this post ;-;)\n\n<br><br>\n- Eddie","topic":"reflection","date":"Mon Jun 08 2020 06:36:41 GMT-0500 (Central Daylight Time)"}]}